# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPWE2ZTllZTdkLTJiNjUtNDFlMS1hZGZiLTBjOGMyMzUxNWNmOTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.altinn_platform_federation_flux_release will be created
  + resource "azurerm_federated_identity_credential" "altinn_platform_federation_flux_release" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "github.altinn.altinn-platform.environment.flux-release"
      + parent_id           = (known after apply)
      + resource_group_name = "acr"
      + subject             = "repo:Altinn/altinn-platform:environment:flux-release"
    }

  # azurerm_federated_identity_credential.altinn_platform_federation_main will be created
  + resource "azurerm_federated_identity_credential" "altinn_platform_federation_main" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "github.altinn.altinn-platform.ref.main"
      + parent_id           = (known after apply)
      + resource_group_name = "acr"
      + subject             = "repo:Altinn/altinn-platform:ref:refs/heads/main"
    }

  # azurerm_role_assignment.altinncr_acrpush_altinn_platform will be created
  + resource "azurerm_role_assignment" "altinncr_acrpush_altinn_platform" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr"
      + skip_service_principal_aad_check = true
    }

  # azurerm_user_assigned_identity.github_pusher will be created
  + resource "azurerm_user_assigned_identity" "github_pusher" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "github-altinn-platform-pusher"
      + principal_id        = (known after apply)
      + resource_group_name = "acr"
      + tenant_id           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-prod/altinncr` |
| State File | `github.com/altinn/altinn-platform/environments/prod/altinncr.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_altinncr.tfstate.tfplan`